{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_18", "sparse": false}, "inbound_nodes": [], "name": "input_18"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_26", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_18", 0, 0, {}]]], "name": "conv1d_26"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_26", "pool_size": [2]}, "inbound_nodes": [[["conv1d_26", 0, 0, {}]]], "name": "max_pooling1d_26"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_17", "sparse": false}, "inbound_nodes": [], "name": "input_17"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_27", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_26", 0, 0, {}]]], "name": "conv1d_27"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_25", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_17", 0, 0, {}]]], "name": "conv1d_25"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_27", "pool_size": [2]}, "inbound_nodes": [[["conv1d_27", 0, 0, {}]]], "name": "max_pooling1d_27"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_65"}, "inbound_nodes": [[["conv1d_25", 0, 0, {}]]], "name": "flatten_65"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_68"}, "inbound_nodes": [[["input_18", 0, 0, {}]]], "name": "flatten_68"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_66"}, "inbound_nodes": [[["conv1d_25", 0, 0, {}]]], "name": "flatten_66"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_69"}, "inbound_nodes": [[["max_pooling1d_26", 0, 0, {}]]], "name": "flatten_69"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_67"}, "inbound_nodes": [[["conv1d_25", 0, 0, {}]]], "name": "flatten_67"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_70"}, "inbound_nodes": [[["max_pooling1d_27", 0, 0, {}]]], "name": "flatten_70"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_41", "axis": -1}, "inbound_nodes": [[["flatten_65", 0, 0, {}], ["flatten_68", 0, 0, {}]]], "name": "concatenate_41"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_42", "axis": -1}, "inbound_nodes": [[["flatten_66", 0, 0, {}], ["flatten_69", 0, 0, {}]]], "name": "concatenate_42"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_43", "axis": -1}, "inbound_nodes": [[["flatten_67", 0, 0, {}], ["flatten_70", 0, 0, {}]]], "name": "concatenate_43"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_70", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_17"}, "inbound_nodes": [[["conv1d_26", 0, 0, {}]]], "name": "time_distributed_17"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_71", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_18"}, "inbound_nodes": [[["conv1d_25", 0, 0, {}]]], "name": "time_distributed_18"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_65", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_41", 0, 0, {}]]], "name": "dense_65"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_66", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_42", 0, 0, {}]]], "name": "dense_66"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_67", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_43", 0, 0, {}]]], "name": "dense_67"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_71"}, "inbound_nodes": [[["time_distributed_17", 0, 0, {}]]], "name": "flatten_71"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_72"}, "inbound_nodes": [[["time_distributed_18", 0, 0, {}]]], "name": "flatten_72"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_44", "axis": -1}, "inbound_nodes": [[["dense_65", 0, 0, {}], ["dense_66", 0, 0, {}], ["dense_67", 0, 0, {}]]], "name": "concatenate_44"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_17"}, "inbound_nodes": [[["conv1d_26", 0, 0, {}]]], "name": "permute_17"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_17"}, "inbound_nodes": [[["flatten_71", 0, 0, {}]]], "name": "activation_17"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_18"}, "inbound_nodes": [[["conv1d_25", 0, 0, {}]]], "name": "permute_18"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_18"}, "inbound_nodes": [[["flatten_72", 0, 0, {}]]], "name": "activation_18"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_68", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_44", 0, 0, {}]]], "name": "dense_68"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_17"}, "inbound_nodes": [[["permute_17", 0, 0, {}], ["activation_17", 0, 0, {}]]], "name": "dot_17"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_18"}, "inbound_nodes": [[["permute_18", 0, 0, {}], ["activation_18", 0, 0, {}]]], "name": "dot_18"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_69", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_68", 0, 0, {}]]], "name": "dense_69"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_45", "axis": -1}, "inbound_nodes": [[["dot_17", 0, 0, {}], ["dot_18", 0, 0, {}], ["dense_69", 0, 0, {}]]], "name": "concatenate_45"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_72", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_45", 0, 0, {}]]], "name": "dense_72"}], "input_layers": [["input_17", 0, 0], ["input_18", 0, 0]], "output_layers": [["dense_72", 0, 0]], "name": "model_9"}, "backend": "tensorflow"}