{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_40", "sparse": false}, "inbound_nodes": [], "name": "input_40"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_59", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_40", 0, 0, {}]]], "name": "conv1d_59"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_59", "pool_size": [2]}, "inbound_nodes": [[["conv1d_59", 0, 0, {}]]], "name": "max_pooling1d_59"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_39", "sparse": false}, "inbound_nodes": [], "name": "input_39"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_60", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_59", 0, 0, {}]]], "name": "conv1d_60"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_58", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_39", 0, 0, {}]]], "name": "conv1d_58"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_60", "pool_size": [2]}, "inbound_nodes": [[["conv1d_60", 0, 0, {}]]], "name": "max_pooling1d_60"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_153"}, "inbound_nodes": [[["conv1d_58", 0, 0, {}]]], "name": "flatten_153"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_156"}, "inbound_nodes": [[["input_40", 0, 0, {}]]], "name": "flatten_156"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_154"}, "inbound_nodes": [[["conv1d_58", 0, 0, {}]]], "name": "flatten_154"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_157"}, "inbound_nodes": [[["max_pooling1d_59", 0, 0, {}]]], "name": "flatten_157"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_155"}, "inbound_nodes": [[["conv1d_58", 0, 0, {}]]], "name": "flatten_155"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_158"}, "inbound_nodes": [[["max_pooling1d_60", 0, 0, {}]]], "name": "flatten_158"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_96", "axis": -1}, "inbound_nodes": [[["flatten_153", 0, 0, {}], ["flatten_156", 0, 0, {}]]], "name": "concatenate_96"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_97", "axis": -1}, "inbound_nodes": [[["flatten_154", 0, 0, {}], ["flatten_157", 0, 0, {}]]], "name": "concatenate_97"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_98", "axis": -1}, "inbound_nodes": [[["flatten_155", 0, 0, {}], ["flatten_158", 0, 0, {}]]], "name": "concatenate_98"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_158", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_39"}, "inbound_nodes": [[["conv1d_59", 0, 0, {}]]], "name": "time_distributed_39"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_159", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_40"}, "inbound_nodes": [[["conv1d_58", 0, 0, {}]]], "name": "time_distributed_40"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_153", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_96", 0, 0, {}]]], "name": "dense_153"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_154", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_97", 0, 0, {}]]], "name": "dense_154"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_155", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_98", 0, 0, {}]]], "name": "dense_155"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_159"}, "inbound_nodes": [[["time_distributed_39", 0, 0, {}]]], "name": "flatten_159"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_160"}, "inbound_nodes": [[["time_distributed_40", 0, 0, {}]]], "name": "flatten_160"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_99", "axis": -1}, "inbound_nodes": [[["dense_153", 0, 0, {}], ["dense_154", 0, 0, {}], ["dense_155", 0, 0, {}]]], "name": "concatenate_99"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_39"}, "inbound_nodes": [[["conv1d_59", 0, 0, {}]]], "name": "permute_39"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_39"}, "inbound_nodes": [[["flatten_159", 0, 0, {}]]], "name": "activation_39"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_40"}, "inbound_nodes": [[["conv1d_58", 0, 0, {}]]], "name": "permute_40"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_40"}, "inbound_nodes": [[["flatten_160", 0, 0, {}]]], "name": "activation_40"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_156", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_99", 0, 0, {}]]], "name": "dense_156"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_39"}, "inbound_nodes": [[["permute_39", 0, 0, {}], ["activation_39", 0, 0, {}]]], "name": "dot_39"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_40"}, "inbound_nodes": [[["permute_40", 0, 0, {}], ["activation_40", 0, 0, {}]]], "name": "dot_40"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_157", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_156", 0, 0, {}]]], "name": "dense_157"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_100", "axis": -1}, "inbound_nodes": [[["dot_39", 0, 0, {}], ["dot_40", 0, 0, {}], ["dense_157", 0, 0, {}]]], "name": "concatenate_100"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_160", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_100", 0, 0, {}]]], "name": "dense_160"}], "input_layers": [["input_39", 0, 0], ["input_40", 0, 0]], "output_layers": [["dense_160", 0, 0]], "name": "model_20"}, "backend": "tensorflow"}