{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_32", "sparse": false}, "inbound_nodes": [], "name": "input_32"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_47", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_32", 0, 0, {}]]], "name": "conv1d_47"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_47", "pool_size": [2]}, "inbound_nodes": [[["conv1d_47", 0, 0, {}]]], "name": "max_pooling1d_47"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_31", "sparse": false}, "inbound_nodes": [], "name": "input_31"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_48", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_47", 0, 0, {}]]], "name": "conv1d_48"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_46", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_31", 0, 0, {}]]], "name": "conv1d_46"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_48", "pool_size": [2]}, "inbound_nodes": [[["conv1d_48", 0, 0, {}]]], "name": "max_pooling1d_48"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_121"}, "inbound_nodes": [[["conv1d_46", 0, 0, {}]]], "name": "flatten_121"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_124"}, "inbound_nodes": [[["input_32", 0, 0, {}]]], "name": "flatten_124"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_122"}, "inbound_nodes": [[["conv1d_46", 0, 0, {}]]], "name": "flatten_122"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_125"}, "inbound_nodes": [[["max_pooling1d_47", 0, 0, {}]]], "name": "flatten_125"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_123"}, "inbound_nodes": [[["conv1d_46", 0, 0, {}]]], "name": "flatten_123"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_126"}, "inbound_nodes": [[["max_pooling1d_48", 0, 0, {}]]], "name": "flatten_126"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_76", "axis": -1}, "inbound_nodes": [[["flatten_121", 0, 0, {}], ["flatten_124", 0, 0, {}]]], "name": "concatenate_76"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_77", "axis": -1}, "inbound_nodes": [[["flatten_122", 0, 0, {}], ["flatten_125", 0, 0, {}]]], "name": "concatenate_77"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_78", "axis": -1}, "inbound_nodes": [[["flatten_123", 0, 0, {}], ["flatten_126", 0, 0, {}]]], "name": "concatenate_78"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_126", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_31"}, "inbound_nodes": [[["conv1d_47", 0, 0, {}]]], "name": "time_distributed_31"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_127", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_32"}, "inbound_nodes": [[["conv1d_46", 0, 0, {}]]], "name": "time_distributed_32"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_121", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_76", 0, 0, {}]]], "name": "dense_121"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_122", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_77", 0, 0, {}]]], "name": "dense_122"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_123", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_78", 0, 0, {}]]], "name": "dense_123"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_127"}, "inbound_nodes": [[["time_distributed_31", 0, 0, {}]]], "name": "flatten_127"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_128"}, "inbound_nodes": [[["time_distributed_32", 0, 0, {}]]], "name": "flatten_128"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_79", "axis": -1}, "inbound_nodes": [[["dense_121", 0, 0, {}], ["dense_122", 0, 0, {}], ["dense_123", 0, 0, {}]]], "name": "concatenate_79"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_31"}, "inbound_nodes": [[["conv1d_47", 0, 0, {}]]], "name": "permute_31"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_31"}, "inbound_nodes": [[["flatten_127", 0, 0, {}]]], "name": "activation_31"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_32"}, "inbound_nodes": [[["conv1d_46", 0, 0, {}]]], "name": "permute_32"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_32"}, "inbound_nodes": [[["flatten_128", 0, 0, {}]]], "name": "activation_32"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_124", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_79", 0, 0, {}]]], "name": "dense_124"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_31"}, "inbound_nodes": [[["permute_31", 0, 0, {}], ["activation_31", 0, 0, {}]]], "name": "dot_31"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_32"}, "inbound_nodes": [[["permute_32", 0, 0, {}], ["activation_32", 0, 0, {}]]], "name": "dot_32"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_125", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_124", 0, 0, {}]]], "name": "dense_125"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_80", "axis": -1}, "inbound_nodes": [[["dot_31", 0, 0, {}], ["dot_32", 0, 0, {}], ["dense_125", 0, 0, {}]]], "name": "concatenate_80"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_128", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_80", 0, 0, {}]]], "name": "dense_128"}], "input_layers": [["input_31", 0, 0], ["input_32", 0, 0]], "output_layers": [["dense_128", 0, 0]], "name": "model_16"}, "backend": "tensorflow"}