{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_26", "sparse": false}, "inbound_nodes": [], "name": "input_26"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_38", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_26", 0, 0, {}]]], "name": "conv1d_38"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_38", "pool_size": [2]}, "inbound_nodes": [[["conv1d_38", 0, 0, {}]]], "name": "max_pooling1d_38"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_25", "sparse": false}, "inbound_nodes": [], "name": "input_25"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_39", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_38", 0, 0, {}]]], "name": "conv1d_39"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_37", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_25", 0, 0, {}]]], "name": "conv1d_37"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_39", "pool_size": [2]}, "inbound_nodes": [[["conv1d_39", 0, 0, {}]]], "name": "max_pooling1d_39"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_97"}, "inbound_nodes": [[["conv1d_37", 0, 0, {}]]], "name": "flatten_97"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_100"}, "inbound_nodes": [[["input_26", 0, 0, {}]]], "name": "flatten_100"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_98"}, "inbound_nodes": [[["conv1d_37", 0, 0, {}]]], "name": "flatten_98"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_101"}, "inbound_nodes": [[["max_pooling1d_38", 0, 0, {}]]], "name": "flatten_101"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_99"}, "inbound_nodes": [[["conv1d_37", 0, 0, {}]]], "name": "flatten_99"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_102"}, "inbound_nodes": [[["max_pooling1d_39", 0, 0, {}]]], "name": "flatten_102"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_61", "axis": -1}, "inbound_nodes": [[["flatten_97", 0, 0, {}], ["flatten_100", 0, 0, {}]]], "name": "concatenate_61"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_62", "axis": -1}, "inbound_nodes": [[["flatten_98", 0, 0, {}], ["flatten_101", 0, 0, {}]]], "name": "concatenate_62"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_63", "axis": -1}, "inbound_nodes": [[["flatten_99", 0, 0, {}], ["flatten_102", 0, 0, {}]]], "name": "concatenate_63"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_102", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_25"}, "inbound_nodes": [[["conv1d_38", 0, 0, {}]]], "name": "time_distributed_25"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_103", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_26"}, "inbound_nodes": [[["conv1d_37", 0, 0, {}]]], "name": "time_distributed_26"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_97", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_61", 0, 0, {}]]], "name": "dense_97"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_98", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_62", 0, 0, {}]]], "name": "dense_98"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_99", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_63", 0, 0, {}]]], "name": "dense_99"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_103"}, "inbound_nodes": [[["time_distributed_25", 0, 0, {}]]], "name": "flatten_103"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_104"}, "inbound_nodes": [[["time_distributed_26", 0, 0, {}]]], "name": "flatten_104"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_64", "axis": -1}, "inbound_nodes": [[["dense_97", 0, 0, {}], ["dense_98", 0, 0, {}], ["dense_99", 0, 0, {}]]], "name": "concatenate_64"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_25"}, "inbound_nodes": [[["conv1d_38", 0, 0, {}]]], "name": "permute_25"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_25"}, "inbound_nodes": [[["flatten_103", 0, 0, {}]]], "name": "activation_25"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_26"}, "inbound_nodes": [[["conv1d_37", 0, 0, {}]]], "name": "permute_26"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_26"}, "inbound_nodes": [[["flatten_104", 0, 0, {}]]], "name": "activation_26"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_100", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_64", 0, 0, {}]]], "name": "dense_100"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_25"}, "inbound_nodes": [[["permute_25", 0, 0, {}], ["activation_25", 0, 0, {}]]], "name": "dot_25"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_26"}, "inbound_nodes": [[["permute_26", 0, 0, {}], ["activation_26", 0, 0, {}]]], "name": "dot_26"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_101", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_100", 0, 0, {}]]], "name": "dense_101"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_65", "axis": -1}, "inbound_nodes": [[["dot_25", 0, 0, {}], ["dot_26", 0, 0, {}], ["dense_101", 0, 0, {}]]], "name": "concatenate_65"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_104", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_65", 0, 0, {}]]], "name": "dense_104"}], "input_layers": [["input_25", 0, 0], ["input_26", 0, 0]], "output_layers": [["dense_104", 0, 0]], "name": "model_13"}, "backend": "tensorflow"}