{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_12", "sparse": false}, "inbound_nodes": [], "name": "input_12"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_17", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_12", 0, 0, {}]]], "name": "conv1d_17"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_17", "pool_size": [2]}, "inbound_nodes": [[["conv1d_17", 0, 0, {}]]], "name": "max_pooling1d_17"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_11", "sparse": false}, "inbound_nodes": [], "name": "input_11"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_18", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_17", 0, 0, {}]]], "name": "conv1d_18"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_16", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "conv1d_16"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_18", "pool_size": [2]}, "inbound_nodes": [[["conv1d_18", 0, 0, {}]]], "name": "max_pooling1d_18"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_41"}, "inbound_nodes": [[["conv1d_16", 0, 0, {}]]], "name": "flatten_41"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_44"}, "inbound_nodes": [[["input_12", 0, 0, {}]]], "name": "flatten_44"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_42"}, "inbound_nodes": [[["conv1d_16", 0, 0, {}]]], "name": "flatten_42"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_45"}, "inbound_nodes": [[["max_pooling1d_17", 0, 0, {}]]], "name": "flatten_45"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_43"}, "inbound_nodes": [[["conv1d_16", 0, 0, {}]]], "name": "flatten_43"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_46"}, "inbound_nodes": [[["max_pooling1d_18", 0, 0, {}]]], "name": "flatten_46"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_26", "axis": -1}, "inbound_nodes": [[["flatten_41", 0, 0, {}], ["flatten_44", 0, 0, {}]]], "name": "concatenate_26"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_27", "axis": -1}, "inbound_nodes": [[["flatten_42", 0, 0, {}], ["flatten_45", 0, 0, {}]]], "name": "concatenate_27"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_28", "axis": -1}, "inbound_nodes": [[["flatten_43", 0, 0, {}], ["flatten_46", 0, 0, {}]]], "name": "concatenate_28"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_46", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_11"}, "inbound_nodes": [[["conv1d_17", 0, 0, {}]]], "name": "time_distributed_11"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_47", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_12"}, "inbound_nodes": [[["conv1d_16", 0, 0, {}]]], "name": "time_distributed_12"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_41", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_26", 0, 0, {}]]], "name": "dense_41"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_42", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_27", 0, 0, {}]]], "name": "dense_42"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_43", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_28", 0, 0, {}]]], "name": "dense_43"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_47"}, "inbound_nodes": [[["time_distributed_11", 0, 0, {}]]], "name": "flatten_47"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_48"}, "inbound_nodes": [[["time_distributed_12", 0, 0, {}]]], "name": "flatten_48"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_29", "axis": -1}, "inbound_nodes": [[["dense_41", 0, 0, {}], ["dense_42", 0, 0, {}], ["dense_43", 0, 0, {}]]], "name": "concatenate_29"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_11"}, "inbound_nodes": [[["conv1d_17", 0, 0, {}]]], "name": "permute_11"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_11"}, "inbound_nodes": [[["flatten_47", 0, 0, {}]]], "name": "activation_11"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_12"}, "inbound_nodes": [[["conv1d_16", 0, 0, {}]]], "name": "permute_12"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_12"}, "inbound_nodes": [[["flatten_48", 0, 0, {}]]], "name": "activation_12"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_44", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_29", 0, 0, {}]]], "name": "dense_44"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_11"}, "inbound_nodes": [[["permute_11", 0, 0, {}], ["activation_11", 0, 0, {}]]], "name": "dot_11"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_12"}, "inbound_nodes": [[["permute_12", 0, 0, {}], ["activation_12", 0, 0, {}]]], "name": "dot_12"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_45", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_44", 0, 0, {}]]], "name": "dense_45"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_30", "axis": -1}, "inbound_nodes": [[["dot_11", 0, 0, {}], ["dot_12", 0, 0, {}], ["dense_45", 0, 0, {}]]], "name": "concatenate_30"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_48", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_30", 0, 0, {}]]], "name": "dense_48"}], "input_layers": [["input_11", 0, 0], ["input_12", 0, 0]], "output_layers": [["dense_48", 0, 0]], "name": "model_6"}, "backend": "tensorflow"}