{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_80", "sparse": false}, "inbound_nodes": [], "name": "input_80"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_119", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_80", 0, 0, {}]]], "name": "conv1d_119"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_119", "pool_size": [2]}, "inbound_nodes": [[["conv1d_119", 0, 0, {}]]], "name": "max_pooling1d_119"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_79", "sparse": false}, "inbound_nodes": [], "name": "input_79"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_120", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_119", 0, 0, {}]]], "name": "conv1d_120"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_118", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_79", 0, 0, {}]]], "name": "conv1d_118"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_120", "pool_size": [2]}, "inbound_nodes": [[["conv1d_120", 0, 0, {}]]], "name": "max_pooling1d_120"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_313"}, "inbound_nodes": [[["conv1d_118", 0, 0, {}]]], "name": "flatten_313"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_316"}, "inbound_nodes": [[["input_80", 0, 0, {}]]], "name": "flatten_316"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_314"}, "inbound_nodes": [[["conv1d_118", 0, 0, {}]]], "name": "flatten_314"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_317"}, "inbound_nodes": [[["max_pooling1d_119", 0, 0, {}]]], "name": "flatten_317"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_315"}, "inbound_nodes": [[["conv1d_118", 0, 0, {}]]], "name": "flatten_315"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_318"}, "inbound_nodes": [[["max_pooling1d_120", 0, 0, {}]]], "name": "flatten_318"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_196", "axis": -1}, "inbound_nodes": [[["flatten_313", 0, 0, {}], ["flatten_316", 0, 0, {}]]], "name": "concatenate_196"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_197", "axis": -1}, "inbound_nodes": [[["flatten_314", 0, 0, {}], ["flatten_317", 0, 0, {}]]], "name": "concatenate_197"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_198", "axis": -1}, "inbound_nodes": [[["flatten_315", 0, 0, {}], ["flatten_318", 0, 0, {}]]], "name": "concatenate_198"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_318", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_79"}, "inbound_nodes": [[["conv1d_119", 0, 0, {}]]], "name": "time_distributed_79"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_319", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_80"}, "inbound_nodes": [[["conv1d_118", 0, 0, {}]]], "name": "time_distributed_80"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_313", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_196", 0, 0, {}]]], "name": "dense_313"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_314", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_197", 0, 0, {}]]], "name": "dense_314"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_315", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_198", 0, 0, {}]]], "name": "dense_315"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_319"}, "inbound_nodes": [[["time_distributed_79", 0, 0, {}]]], "name": "flatten_319"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_320"}, "inbound_nodes": [[["time_distributed_80", 0, 0, {}]]], "name": "flatten_320"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_199", "axis": -1}, "inbound_nodes": [[["dense_313", 0, 0, {}], ["dense_314", 0, 0, {}], ["dense_315", 0, 0, {}]]], "name": "concatenate_199"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_79"}, "inbound_nodes": [[["conv1d_119", 0, 0, {}]]], "name": "permute_79"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_79"}, "inbound_nodes": [[["flatten_319", 0, 0, {}]]], "name": "activation_79"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_80"}, "inbound_nodes": [[["conv1d_118", 0, 0, {}]]], "name": "permute_80"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_80"}, "inbound_nodes": [[["flatten_320", 0, 0, {}]]], "name": "activation_80"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_316", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_199", 0, 0, {}]]], "name": "dense_316"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_79"}, "inbound_nodes": [[["permute_79", 0, 0, {}], ["activation_79", 0, 0, {}]]], "name": "dot_79"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_80"}, "inbound_nodes": [[["permute_80", 0, 0, {}], ["activation_80", 0, 0, {}]]], "name": "dot_80"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_317", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_316", 0, 0, {}]]], "name": "dense_317"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_200", "axis": -1}, "inbound_nodes": [[["dot_79", 0, 0, {}], ["dot_80", 0, 0, {}], ["dense_317", 0, 0, {}]]], "name": "concatenate_200"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_320", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_200", 0, 0, {}]]], "name": "dense_320"}], "input_layers": [["input_79", 0, 0], ["input_80", 0, 0]], "output_layers": [["dense_320", 0, 0]], "name": "model_40"}, "backend": "tensorflow"}