{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_56", "sparse": false}, "inbound_nodes": [], "name": "input_56"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_83", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_56", 0, 0, {}]]], "name": "conv1d_83"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_83", "pool_size": [2]}, "inbound_nodes": [[["conv1d_83", 0, 0, {}]]], "name": "max_pooling1d_83"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_55", "sparse": false}, "inbound_nodes": [], "name": "input_55"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_84", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_83", 0, 0, {}]]], "name": "conv1d_84"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_82", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_55", 0, 0, {}]]], "name": "conv1d_82"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_84", "pool_size": [2]}, "inbound_nodes": [[["conv1d_84", 0, 0, {}]]], "name": "max_pooling1d_84"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_217"}, "inbound_nodes": [[["conv1d_82", 0, 0, {}]]], "name": "flatten_217"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_220"}, "inbound_nodes": [[["input_56", 0, 0, {}]]], "name": "flatten_220"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_218"}, "inbound_nodes": [[["conv1d_82", 0, 0, {}]]], "name": "flatten_218"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_221"}, "inbound_nodes": [[["max_pooling1d_83", 0, 0, {}]]], "name": "flatten_221"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_219"}, "inbound_nodes": [[["conv1d_82", 0, 0, {}]]], "name": "flatten_219"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_222"}, "inbound_nodes": [[["max_pooling1d_84", 0, 0, {}]]], "name": "flatten_222"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_136", "axis": -1}, "inbound_nodes": [[["flatten_217", 0, 0, {}], ["flatten_220", 0, 0, {}]]], "name": "concatenate_136"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_137", "axis": -1}, "inbound_nodes": [[["flatten_218", 0, 0, {}], ["flatten_221", 0, 0, {}]]], "name": "concatenate_137"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_138", "axis": -1}, "inbound_nodes": [[["flatten_219", 0, 0, {}], ["flatten_222", 0, 0, {}]]], "name": "concatenate_138"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_222", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_55"}, "inbound_nodes": [[["conv1d_83", 0, 0, {}]]], "name": "time_distributed_55"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_223", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_56"}, "inbound_nodes": [[["conv1d_82", 0, 0, {}]]], "name": "time_distributed_56"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_217", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_136", 0, 0, {}]]], "name": "dense_217"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_218", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_137", 0, 0, {}]]], "name": "dense_218"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_219", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_138", 0, 0, {}]]], "name": "dense_219"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_223"}, "inbound_nodes": [[["time_distributed_55", 0, 0, {}]]], "name": "flatten_223"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_224"}, "inbound_nodes": [[["time_distributed_56", 0, 0, {}]]], "name": "flatten_224"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_139", "axis": -1}, "inbound_nodes": [[["dense_217", 0, 0, {}], ["dense_218", 0, 0, {}], ["dense_219", 0, 0, {}]]], "name": "concatenate_139"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_55"}, "inbound_nodes": [[["conv1d_83", 0, 0, {}]]], "name": "permute_55"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_55"}, "inbound_nodes": [[["flatten_223", 0, 0, {}]]], "name": "activation_55"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_56"}, "inbound_nodes": [[["conv1d_82", 0, 0, {}]]], "name": "permute_56"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_56"}, "inbound_nodes": [[["flatten_224", 0, 0, {}]]], "name": "activation_56"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_220", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_139", 0, 0, {}]]], "name": "dense_220"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_55"}, "inbound_nodes": [[["permute_55", 0, 0, {}], ["activation_55", 0, 0, {}]]], "name": "dot_55"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_56"}, "inbound_nodes": [[["permute_56", 0, 0, {}], ["activation_56", 0, 0, {}]]], "name": "dot_56"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_221", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_220", 0, 0, {}]]], "name": "dense_221"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_140", "axis": -1}, "inbound_nodes": [[["dot_55", 0, 0, {}], ["dot_56", 0, 0, {}], ["dense_221", 0, 0, {}]]], "name": "concatenate_140"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_224", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_140", 0, 0, {}]]], "name": "dense_224"}], "input_layers": [["input_55", 0, 0], ["input_56", 0, 0]], "output_layers": [["dense_224", 0, 0]], "name": "model_28"}, "backend": "tensorflow"}