{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_34", "sparse": false}, "inbound_nodes": [], "name": "input_34"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_50", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_34", 0, 0, {}]]], "name": "conv1d_50"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_50", "pool_size": [2]}, "inbound_nodes": [[["conv1d_50", 0, 0, {}]]], "name": "max_pooling1d_50"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_33", "sparse": false}, "inbound_nodes": [], "name": "input_33"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_51", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_50", 0, 0, {}]]], "name": "conv1d_51"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_49", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_33", 0, 0, {}]]], "name": "conv1d_49"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_51", "pool_size": [2]}, "inbound_nodes": [[["conv1d_51", 0, 0, {}]]], "name": "max_pooling1d_51"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_129"}, "inbound_nodes": [[["conv1d_49", 0, 0, {}]]], "name": "flatten_129"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_132"}, "inbound_nodes": [[["input_34", 0, 0, {}]]], "name": "flatten_132"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_130"}, "inbound_nodes": [[["conv1d_49", 0, 0, {}]]], "name": "flatten_130"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_133"}, "inbound_nodes": [[["max_pooling1d_50", 0, 0, {}]]], "name": "flatten_133"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_131"}, "inbound_nodes": [[["conv1d_49", 0, 0, {}]]], "name": "flatten_131"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_134"}, "inbound_nodes": [[["max_pooling1d_51", 0, 0, {}]]], "name": "flatten_134"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_81", "axis": -1}, "inbound_nodes": [[["flatten_129", 0, 0, {}], ["flatten_132", 0, 0, {}]]], "name": "concatenate_81"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_82", "axis": -1}, "inbound_nodes": [[["flatten_130", 0, 0, {}], ["flatten_133", 0, 0, {}]]], "name": "concatenate_82"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_83", "axis": -1}, "inbound_nodes": [[["flatten_131", 0, 0, {}], ["flatten_134", 0, 0, {}]]], "name": "concatenate_83"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_134", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_33"}, "inbound_nodes": [[["conv1d_50", 0, 0, {}]]], "name": "time_distributed_33"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_135", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_34"}, "inbound_nodes": [[["conv1d_49", 0, 0, {}]]], "name": "time_distributed_34"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_129", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_81", 0, 0, {}]]], "name": "dense_129"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_130", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_82", 0, 0, {}]]], "name": "dense_130"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_131", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_83", 0, 0, {}]]], "name": "dense_131"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_135"}, "inbound_nodes": [[["time_distributed_33", 0, 0, {}]]], "name": "flatten_135"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_136"}, "inbound_nodes": [[["time_distributed_34", 0, 0, {}]]], "name": "flatten_136"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_84", "axis": -1}, "inbound_nodes": [[["dense_129", 0, 0, {}], ["dense_130", 0, 0, {}], ["dense_131", 0, 0, {}]]], "name": "concatenate_84"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_33"}, "inbound_nodes": [[["conv1d_50", 0, 0, {}]]], "name": "permute_33"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_33"}, "inbound_nodes": [[["flatten_135", 0, 0, {}]]], "name": "activation_33"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_34"}, "inbound_nodes": [[["conv1d_49", 0, 0, {}]]], "name": "permute_34"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_34"}, "inbound_nodes": [[["flatten_136", 0, 0, {}]]], "name": "activation_34"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_132", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_84", 0, 0, {}]]], "name": "dense_132"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_33"}, "inbound_nodes": [[["permute_33", 0, 0, {}], ["activation_33", 0, 0, {}]]], "name": "dot_33"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_34"}, "inbound_nodes": [[["permute_34", 0, 0, {}], ["activation_34", 0, 0, {}]]], "name": "dot_34"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_133", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_132", 0, 0, {}]]], "name": "dense_133"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_85", "axis": -1}, "inbound_nodes": [[["dot_33", 0, 0, {}], ["dot_34", 0, 0, {}], ["dense_133", 0, 0, {}]]], "name": "concatenate_85"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_136", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_85", 0, 0, {}]]], "name": "dense_136"}], "input_layers": [["input_33", 0, 0], ["input_34", 0, 0]], "output_layers": [["dense_136", 0, 0]], "name": "model_17"}, "backend": "tensorflow"}