{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_28", "sparse": false}, "inbound_nodes": [], "name": "input_28"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_41", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_28", 0, 0, {}]]], "name": "conv1d_41"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_41", "pool_size": [2]}, "inbound_nodes": [[["conv1d_41", 0, 0, {}]]], "name": "max_pooling1d_41"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_27", "sparse": false}, "inbound_nodes": [], "name": "input_27"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_42", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_41", 0, 0, {}]]], "name": "conv1d_42"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_40", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_27", 0, 0, {}]]], "name": "conv1d_40"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_42", "pool_size": [2]}, "inbound_nodes": [[["conv1d_42", 0, 0, {}]]], "name": "max_pooling1d_42"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_105"}, "inbound_nodes": [[["conv1d_40", 0, 0, {}]]], "name": "flatten_105"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_108"}, "inbound_nodes": [[["input_28", 0, 0, {}]]], "name": "flatten_108"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_106"}, "inbound_nodes": [[["conv1d_40", 0, 0, {}]]], "name": "flatten_106"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_109"}, "inbound_nodes": [[["max_pooling1d_41", 0, 0, {}]]], "name": "flatten_109"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_107"}, "inbound_nodes": [[["conv1d_40", 0, 0, {}]]], "name": "flatten_107"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_110"}, "inbound_nodes": [[["max_pooling1d_42", 0, 0, {}]]], "name": "flatten_110"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_66", "axis": -1}, "inbound_nodes": [[["flatten_105", 0, 0, {}], ["flatten_108", 0, 0, {}]]], "name": "concatenate_66"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_67", "axis": -1}, "inbound_nodes": [[["flatten_106", 0, 0, {}], ["flatten_109", 0, 0, {}]]], "name": "concatenate_67"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_68", "axis": -1}, "inbound_nodes": [[["flatten_107", 0, 0, {}], ["flatten_110", 0, 0, {}]]], "name": "concatenate_68"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_110", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_27"}, "inbound_nodes": [[["conv1d_41", 0, 0, {}]]], "name": "time_distributed_27"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_111", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_28"}, "inbound_nodes": [[["conv1d_40", 0, 0, {}]]], "name": "time_distributed_28"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_105", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_66", 0, 0, {}]]], "name": "dense_105"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_106", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_67", 0, 0, {}]]], "name": "dense_106"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_107", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_68", 0, 0, {}]]], "name": "dense_107"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_111"}, "inbound_nodes": [[["time_distributed_27", 0, 0, {}]]], "name": "flatten_111"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_112"}, "inbound_nodes": [[["time_distributed_28", 0, 0, {}]]], "name": "flatten_112"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_69", "axis": -1}, "inbound_nodes": [[["dense_105", 0, 0, {}], ["dense_106", 0, 0, {}], ["dense_107", 0, 0, {}]]], "name": "concatenate_69"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_27"}, "inbound_nodes": [[["conv1d_41", 0, 0, {}]]], "name": "permute_27"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_27"}, "inbound_nodes": [[["flatten_111", 0, 0, {}]]], "name": "activation_27"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_28"}, "inbound_nodes": [[["conv1d_40", 0, 0, {}]]], "name": "permute_28"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_28"}, "inbound_nodes": [[["flatten_112", 0, 0, {}]]], "name": "activation_28"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_108", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_69", 0, 0, {}]]], "name": "dense_108"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_27"}, "inbound_nodes": [[["permute_27", 0, 0, {}], ["activation_27", 0, 0, {}]]], "name": "dot_27"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_28"}, "inbound_nodes": [[["permute_28", 0, 0, {}], ["activation_28", 0, 0, {}]]], "name": "dot_28"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_109", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_108", 0, 0, {}]]], "name": "dense_109"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_70", "axis": -1}, "inbound_nodes": [[["dot_27", 0, 0, {}], ["dot_28", 0, 0, {}], ["dense_109", 0, 0, {}]]], "name": "concatenate_70"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_112", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_70", 0, 0, {}]]], "name": "dense_112"}], "input_layers": [["input_27", 0, 0], ["input_28", 0, 0]], "output_layers": [["dense_112", 0, 0]], "name": "model_14"}, "backend": "tensorflow"}