{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_58", "sparse": false}, "inbound_nodes": [], "name": "input_58"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_86", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_58", 0, 0, {}]]], "name": "conv1d_86"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_86", "pool_size": [2]}, "inbound_nodes": [[["conv1d_86", 0, 0, {}]]], "name": "max_pooling1d_86"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_57", "sparse": false}, "inbound_nodes": [], "name": "input_57"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_87", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_86", 0, 0, {}]]], "name": "conv1d_87"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_85", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_57", 0, 0, {}]]], "name": "conv1d_85"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_87", "pool_size": [2]}, "inbound_nodes": [[["conv1d_87", 0, 0, {}]]], "name": "max_pooling1d_87"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_225"}, "inbound_nodes": [[["conv1d_85", 0, 0, {}]]], "name": "flatten_225"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_228"}, "inbound_nodes": [[["input_58", 0, 0, {}]]], "name": "flatten_228"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_226"}, "inbound_nodes": [[["conv1d_85", 0, 0, {}]]], "name": "flatten_226"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_229"}, "inbound_nodes": [[["max_pooling1d_86", 0, 0, {}]]], "name": "flatten_229"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_227"}, "inbound_nodes": [[["conv1d_85", 0, 0, {}]]], "name": "flatten_227"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_230"}, "inbound_nodes": [[["max_pooling1d_87", 0, 0, {}]]], "name": "flatten_230"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_141", "axis": -1}, "inbound_nodes": [[["flatten_225", 0, 0, {}], ["flatten_228", 0, 0, {}]]], "name": "concatenate_141"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_142", "axis": -1}, "inbound_nodes": [[["flatten_226", 0, 0, {}], ["flatten_229", 0, 0, {}]]], "name": "concatenate_142"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_143", "axis": -1}, "inbound_nodes": [[["flatten_227", 0, 0, {}], ["flatten_230", 0, 0, {}]]], "name": "concatenate_143"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_230", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_57"}, "inbound_nodes": [[["conv1d_86", 0, 0, {}]]], "name": "time_distributed_57"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_231", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_58"}, "inbound_nodes": [[["conv1d_85", 0, 0, {}]]], "name": "time_distributed_58"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_225", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_141", 0, 0, {}]]], "name": "dense_225"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_226", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_142", 0, 0, {}]]], "name": "dense_226"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_227", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_143", 0, 0, {}]]], "name": "dense_227"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_231"}, "inbound_nodes": [[["time_distributed_57", 0, 0, {}]]], "name": "flatten_231"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_232"}, "inbound_nodes": [[["time_distributed_58", 0, 0, {}]]], "name": "flatten_232"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_144", "axis": -1}, "inbound_nodes": [[["dense_225", 0, 0, {}], ["dense_226", 0, 0, {}], ["dense_227", 0, 0, {}]]], "name": "concatenate_144"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_57"}, "inbound_nodes": [[["conv1d_86", 0, 0, {}]]], "name": "permute_57"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_57"}, "inbound_nodes": [[["flatten_231", 0, 0, {}]]], "name": "activation_57"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_58"}, "inbound_nodes": [[["conv1d_85", 0, 0, {}]]], "name": "permute_58"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_58"}, "inbound_nodes": [[["flatten_232", 0, 0, {}]]], "name": "activation_58"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_228", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_144", 0, 0, {}]]], "name": "dense_228"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_57"}, "inbound_nodes": [[["permute_57", 0, 0, {}], ["activation_57", 0, 0, {}]]], "name": "dot_57"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_58"}, "inbound_nodes": [[["permute_58", 0, 0, {}], ["activation_58", 0, 0, {}]]], "name": "dot_58"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_229", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_228", 0, 0, {}]]], "name": "dense_229"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_145", "axis": -1}, "inbound_nodes": [[["dot_57", 0, 0, {}], ["dot_58", 0, 0, {}], ["dense_229", 0, 0, {}]]], "name": "concatenate_145"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_232", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_145", 0, 0, {}]]], "name": "dense_232"}], "input_layers": [["input_57", 0, 0], ["input_58", 0, 0]], "output_layers": [["dense_232", 0, 0]], "name": "model_29"}, "backend": "tensorflow"}