{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_20", "sparse": false}, "inbound_nodes": [], "name": "input_20"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_29", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_20", 0, 0, {}]]], "name": "conv1d_29"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_29", "pool_size": [2]}, "inbound_nodes": [[["conv1d_29", 0, 0, {}]]], "name": "max_pooling1d_29"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_19", "sparse": false}, "inbound_nodes": [], "name": "input_19"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_30", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_29", 0, 0, {}]]], "name": "conv1d_30"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_28", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_19", 0, 0, {}]]], "name": "conv1d_28"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_30", "pool_size": [2]}, "inbound_nodes": [[["conv1d_30", 0, 0, {}]]], "name": "max_pooling1d_30"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_73"}, "inbound_nodes": [[["conv1d_28", 0, 0, {}]]], "name": "flatten_73"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_76"}, "inbound_nodes": [[["input_20", 0, 0, {}]]], "name": "flatten_76"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_74"}, "inbound_nodes": [[["conv1d_28", 0, 0, {}]]], "name": "flatten_74"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_77"}, "inbound_nodes": [[["max_pooling1d_29", 0, 0, {}]]], "name": "flatten_77"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_75"}, "inbound_nodes": [[["conv1d_28", 0, 0, {}]]], "name": "flatten_75"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_78"}, "inbound_nodes": [[["max_pooling1d_30", 0, 0, {}]]], "name": "flatten_78"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_46", "axis": -1}, "inbound_nodes": [[["flatten_73", 0, 0, {}], ["flatten_76", 0, 0, {}]]], "name": "concatenate_46"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_47", "axis": -1}, "inbound_nodes": [[["flatten_74", 0, 0, {}], ["flatten_77", 0, 0, {}]]], "name": "concatenate_47"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_48", "axis": -1}, "inbound_nodes": [[["flatten_75", 0, 0, {}], ["flatten_78", 0, 0, {}]]], "name": "concatenate_48"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_78", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_19"}, "inbound_nodes": [[["conv1d_29", 0, 0, {}]]], "name": "time_distributed_19"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_79", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_20"}, "inbound_nodes": [[["conv1d_28", 0, 0, {}]]], "name": "time_distributed_20"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_73", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_46", 0, 0, {}]]], "name": "dense_73"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_74", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_47", 0, 0, {}]]], "name": "dense_74"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_75", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_48", 0, 0, {}]]], "name": "dense_75"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_79"}, "inbound_nodes": [[["time_distributed_19", 0, 0, {}]]], "name": "flatten_79"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_80"}, "inbound_nodes": [[["time_distributed_20", 0, 0, {}]]], "name": "flatten_80"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_49", "axis": -1}, "inbound_nodes": [[["dense_73", 0, 0, {}], ["dense_74", 0, 0, {}], ["dense_75", 0, 0, {}]]], "name": "concatenate_49"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_19"}, "inbound_nodes": [[["conv1d_29", 0, 0, {}]]], "name": "permute_19"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_19"}, "inbound_nodes": [[["flatten_79", 0, 0, {}]]], "name": "activation_19"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_20"}, "inbound_nodes": [[["conv1d_28", 0, 0, {}]]], "name": "permute_20"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_20"}, "inbound_nodes": [[["flatten_80", 0, 0, {}]]], "name": "activation_20"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_76", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_49", 0, 0, {}]]], "name": "dense_76"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_19"}, "inbound_nodes": [[["permute_19", 0, 0, {}], ["activation_19", 0, 0, {}]]], "name": "dot_19"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_20"}, "inbound_nodes": [[["permute_20", 0, 0, {}], ["activation_20", 0, 0, {}]]], "name": "dot_20"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_77", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_76", 0, 0, {}]]], "name": "dense_77"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_50", "axis": -1}, "inbound_nodes": [[["dot_19", 0, 0, {}], ["dot_20", 0, 0, {}], ["dense_77", 0, 0, {}]]], "name": "concatenate_50"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_80", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_50", 0, 0, {}]]], "name": "dense_80"}], "input_layers": [["input_19", 0, 0], ["input_20", 0, 0]], "output_layers": [["dense_80", 0, 0]], "name": "model_10"}, "backend": "tensorflow"}