{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_14", "sparse": false}, "inbound_nodes": [], "name": "input_14"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_20", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_14", 0, 0, {}]]], "name": "conv1d_20"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_20", "pool_size": [2]}, "inbound_nodes": [[["conv1d_20", 0, 0, {}]]], "name": "max_pooling1d_20"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_13", "sparse": false}, "inbound_nodes": [], "name": "input_13"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_21", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_20", 0, 0, {}]]], "name": "conv1d_21"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_19", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_13", 0, 0, {}]]], "name": "conv1d_19"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_21", "pool_size": [2]}, "inbound_nodes": [[["conv1d_21", 0, 0, {}]]], "name": "max_pooling1d_21"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_49"}, "inbound_nodes": [[["conv1d_19", 0, 0, {}]]], "name": "flatten_49"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_52"}, "inbound_nodes": [[["input_14", 0, 0, {}]]], "name": "flatten_52"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_50"}, "inbound_nodes": [[["conv1d_19", 0, 0, {}]]], "name": "flatten_50"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_53"}, "inbound_nodes": [[["max_pooling1d_20", 0, 0, {}]]], "name": "flatten_53"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_51"}, "inbound_nodes": [[["conv1d_19", 0, 0, {}]]], "name": "flatten_51"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_54"}, "inbound_nodes": [[["max_pooling1d_21", 0, 0, {}]]], "name": "flatten_54"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_31", "axis": -1}, "inbound_nodes": [[["flatten_49", 0, 0, {}], ["flatten_52", 0, 0, {}]]], "name": "concatenate_31"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_32", "axis": -1}, "inbound_nodes": [[["flatten_50", 0, 0, {}], ["flatten_53", 0, 0, {}]]], "name": "concatenate_32"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_33", "axis": -1}, "inbound_nodes": [[["flatten_51", 0, 0, {}], ["flatten_54", 0, 0, {}]]], "name": "concatenate_33"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_54", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_13"}, "inbound_nodes": [[["conv1d_20", 0, 0, {}]]], "name": "time_distributed_13"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_55", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_14"}, "inbound_nodes": [[["conv1d_19", 0, 0, {}]]], "name": "time_distributed_14"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_49", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_31", 0, 0, {}]]], "name": "dense_49"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_50", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_32", 0, 0, {}]]], "name": "dense_50"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_51", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_33", 0, 0, {}]]], "name": "dense_51"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_55"}, "inbound_nodes": [[["time_distributed_13", 0, 0, {}]]], "name": "flatten_55"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_56"}, "inbound_nodes": [[["time_distributed_14", 0, 0, {}]]], "name": "flatten_56"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_34", "axis": -1}, "inbound_nodes": [[["dense_49", 0, 0, {}], ["dense_50", 0, 0, {}], ["dense_51", 0, 0, {}]]], "name": "concatenate_34"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_13"}, "inbound_nodes": [[["conv1d_20", 0, 0, {}]]], "name": "permute_13"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_13"}, "inbound_nodes": [[["flatten_55", 0, 0, {}]]], "name": "activation_13"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_14"}, "inbound_nodes": [[["conv1d_19", 0, 0, {}]]], "name": "permute_14"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_14"}, "inbound_nodes": [[["flatten_56", 0, 0, {}]]], "name": "activation_14"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_52", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_34", 0, 0, {}]]], "name": "dense_52"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_13"}, "inbound_nodes": [[["permute_13", 0, 0, {}], ["activation_13", 0, 0, {}]]], "name": "dot_13"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_14"}, "inbound_nodes": [[["permute_14", 0, 0, {}], ["activation_14", 0, 0, {}]]], "name": "dot_14"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_53", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_52", 0, 0, {}]]], "name": "dense_53"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_35", "axis": -1}, "inbound_nodes": [[["dot_13", 0, 0, {}], ["dot_14", 0, 0, {}], ["dense_53", 0, 0, {}]]], "name": "concatenate_35"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_56", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_35", 0, 0, {}]]], "name": "dense_56"}], "input_layers": [["input_13", 0, 0], ["input_14", 0, 0]], "output_layers": [["dense_56", 0, 0]], "name": "model_7"}, "backend": "tensorflow"}