{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_42", "sparse": false}, "inbound_nodes": [], "name": "input_42"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_62", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_42", 0, 0, {}]]], "name": "conv1d_62"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_62", "pool_size": [2]}, "inbound_nodes": [[["conv1d_62", 0, 0, {}]]], "name": "max_pooling1d_62"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_41", "sparse": false}, "inbound_nodes": [], "name": "input_41"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_63", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_62", 0, 0, {}]]], "name": "conv1d_63"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_61", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_41", 0, 0, {}]]], "name": "conv1d_61"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_63", "pool_size": [2]}, "inbound_nodes": [[["conv1d_63", 0, 0, {}]]], "name": "max_pooling1d_63"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_161"}, "inbound_nodes": [[["conv1d_61", 0, 0, {}]]], "name": "flatten_161"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_164"}, "inbound_nodes": [[["input_42", 0, 0, {}]]], "name": "flatten_164"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_162"}, "inbound_nodes": [[["conv1d_61", 0, 0, {}]]], "name": "flatten_162"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_165"}, "inbound_nodes": [[["max_pooling1d_62", 0, 0, {}]]], "name": "flatten_165"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_163"}, "inbound_nodes": [[["conv1d_61", 0, 0, {}]]], "name": "flatten_163"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_166"}, "inbound_nodes": [[["max_pooling1d_63", 0, 0, {}]]], "name": "flatten_166"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_101", "axis": -1}, "inbound_nodes": [[["flatten_161", 0, 0, {}], ["flatten_164", 0, 0, {}]]], "name": "concatenate_101"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_102", "axis": -1}, "inbound_nodes": [[["flatten_162", 0, 0, {}], ["flatten_165", 0, 0, {}]]], "name": "concatenate_102"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_103", "axis": -1}, "inbound_nodes": [[["flatten_163", 0, 0, {}], ["flatten_166", 0, 0, {}]]], "name": "concatenate_103"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_166", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_41"}, "inbound_nodes": [[["conv1d_62", 0, 0, {}]]], "name": "time_distributed_41"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_167", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_42"}, "inbound_nodes": [[["conv1d_61", 0, 0, {}]]], "name": "time_distributed_42"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_161", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_101", 0, 0, {}]]], "name": "dense_161"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_162", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_102", 0, 0, {}]]], "name": "dense_162"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_163", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_103", 0, 0, {}]]], "name": "dense_163"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_167"}, "inbound_nodes": [[["time_distributed_41", 0, 0, {}]]], "name": "flatten_167"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_168"}, "inbound_nodes": [[["time_distributed_42", 0, 0, {}]]], "name": "flatten_168"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_104", "axis": -1}, "inbound_nodes": [[["dense_161", 0, 0, {}], ["dense_162", 0, 0, {}], ["dense_163", 0, 0, {}]]], "name": "concatenate_104"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_41"}, "inbound_nodes": [[["conv1d_62", 0, 0, {}]]], "name": "permute_41"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_41"}, "inbound_nodes": [[["flatten_167", 0, 0, {}]]], "name": "activation_41"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_42"}, "inbound_nodes": [[["conv1d_61", 0, 0, {}]]], "name": "permute_42"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_42"}, "inbound_nodes": [[["flatten_168", 0, 0, {}]]], "name": "activation_42"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_164", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_104", 0, 0, {}]]], "name": "dense_164"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_41"}, "inbound_nodes": [[["permute_41", 0, 0, {}], ["activation_41", 0, 0, {}]]], "name": "dot_41"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_42"}, "inbound_nodes": [[["permute_42", 0, 0, {}], ["activation_42", 0, 0, {}]]], "name": "dot_42"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_165", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_164", 0, 0, {}]]], "name": "dense_165"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_105", "axis": -1}, "inbound_nodes": [[["dot_41", 0, 0, {}], ["dot_42", 0, 0, {}], ["dense_165", 0, 0, {}]]], "name": "concatenate_105"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_168", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_105", 0, 0, {}]]], "name": "dense_168"}], "input_layers": [["input_41", 0, 0], ["input_42", 0, 0]], "output_layers": [["dense_168", 0, 0]], "name": "model_21"}, "backend": "tensorflow"}