{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_8", "sparse": false}, "inbound_nodes": [], "name": "input_8"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_11", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_8", 0, 0, {}]]], "name": "conv1d_11"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_11", "pool_size": [2]}, "inbound_nodes": [[["conv1d_11", 0, 0, {}]]], "name": "max_pooling1d_11"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_7", "sparse": false}, "inbound_nodes": [], "name": "input_7"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_12", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_11", 0, 0, {}]]], "name": "conv1d_12"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_10", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_7", 0, 0, {}]]], "name": "conv1d_10"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_12", "pool_size": [2]}, "inbound_nodes": [[["conv1d_12", 0, 0, {}]]], "name": "max_pooling1d_12"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_25"}, "inbound_nodes": [[["conv1d_10", 0, 0, {}]]], "name": "flatten_25"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_28"}, "inbound_nodes": [[["input_8", 0, 0, {}]]], "name": "flatten_28"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_26"}, "inbound_nodes": [[["conv1d_10", 0, 0, {}]]], "name": "flatten_26"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_29"}, "inbound_nodes": [[["max_pooling1d_11", 0, 0, {}]]], "name": "flatten_29"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_27"}, "inbound_nodes": [[["conv1d_10", 0, 0, {}]]], "name": "flatten_27"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_30"}, "inbound_nodes": [[["max_pooling1d_12", 0, 0, {}]]], "name": "flatten_30"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_16", "axis": -1}, "inbound_nodes": [[["flatten_25", 0, 0, {}], ["flatten_28", 0, 0, {}]]], "name": "concatenate_16"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_17", "axis": -1}, "inbound_nodes": [[["flatten_26", 0, 0, {}], ["flatten_29", 0, 0, {}]]], "name": "concatenate_17"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_18", "axis": -1}, "inbound_nodes": [[["flatten_27", 0, 0, {}], ["flatten_30", 0, 0, {}]]], "name": "concatenate_18"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_30", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_7"}, "inbound_nodes": [[["conv1d_11", 0, 0, {}]]], "name": "time_distributed_7"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_31", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_8"}, "inbound_nodes": [[["conv1d_10", 0, 0, {}]]], "name": "time_distributed_8"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_25", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_16", 0, 0, {}]]], "name": "dense_25"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_26", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_17", 0, 0, {}]]], "name": "dense_26"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_27", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_18", 0, 0, {}]]], "name": "dense_27"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_31"}, "inbound_nodes": [[["time_distributed_7", 0, 0, {}]]], "name": "flatten_31"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_32"}, "inbound_nodes": [[["time_distributed_8", 0, 0, {}]]], "name": "flatten_32"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_19", "axis": -1}, "inbound_nodes": [[["dense_25", 0, 0, {}], ["dense_26", 0, 0, {}], ["dense_27", 0, 0, {}]]], "name": "concatenate_19"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_7"}, "inbound_nodes": [[["conv1d_11", 0, 0, {}]]], "name": "permute_7"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_7"}, "inbound_nodes": [[["flatten_31", 0, 0, {}]]], "name": "activation_7"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_8"}, "inbound_nodes": [[["conv1d_10", 0, 0, {}]]], "name": "permute_8"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_8"}, "inbound_nodes": [[["flatten_32", 0, 0, {}]]], "name": "activation_8"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_28", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_19", 0, 0, {}]]], "name": "dense_28"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_7"}, "inbound_nodes": [[["permute_7", 0, 0, {}], ["activation_7", 0, 0, {}]]], "name": "dot_7"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_8"}, "inbound_nodes": [[["permute_8", 0, 0, {}], ["activation_8", 0, 0, {}]]], "name": "dot_8"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_29", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_28", 0, 0, {}]]], "name": "dense_29"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_20", "axis": -1}, "inbound_nodes": [[["dot_7", 0, 0, {}], ["dot_8", 0, 0, {}], ["dense_29", 0, 0, {}]]], "name": "concatenate_20"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_32", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_20", 0, 0, {}]]], "name": "dense_32"}], "input_layers": [["input_7", 0, 0], ["input_8", 0, 0]], "output_layers": [["dense_32", 0, 0]], "name": "model_4"}, "backend": "tensorflow"}