{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_78", "sparse": false}, "inbound_nodes": [], "name": "input_78"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_116", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_78", 0, 0, {}]]], "name": "conv1d_116"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_116", "pool_size": [2]}, "inbound_nodes": [[["conv1d_116", 0, 0, {}]]], "name": "max_pooling1d_116"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_77", "sparse": false}, "inbound_nodes": [], "name": "input_77"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_117", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_116", 0, 0, {}]]], "name": "conv1d_117"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_115", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_77", 0, 0, {}]]], "name": "conv1d_115"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_117", "pool_size": [2]}, "inbound_nodes": [[["conv1d_117", 0, 0, {}]]], "name": "max_pooling1d_117"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_305"}, "inbound_nodes": [[["conv1d_115", 0, 0, {}]]], "name": "flatten_305"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_308"}, "inbound_nodes": [[["input_78", 0, 0, {}]]], "name": "flatten_308"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_306"}, "inbound_nodes": [[["conv1d_115", 0, 0, {}]]], "name": "flatten_306"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_309"}, "inbound_nodes": [[["max_pooling1d_116", 0, 0, {}]]], "name": "flatten_309"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_307"}, "inbound_nodes": [[["conv1d_115", 0, 0, {}]]], "name": "flatten_307"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_310"}, "inbound_nodes": [[["max_pooling1d_117", 0, 0, {}]]], "name": "flatten_310"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_191", "axis": -1}, "inbound_nodes": [[["flatten_305", 0, 0, {}], ["flatten_308", 0, 0, {}]]], "name": "concatenate_191"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_192", "axis": -1}, "inbound_nodes": [[["flatten_306", 0, 0, {}], ["flatten_309", 0, 0, {}]]], "name": "concatenate_192"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_193", "axis": -1}, "inbound_nodes": [[["flatten_307", 0, 0, {}], ["flatten_310", 0, 0, {}]]], "name": "concatenate_193"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_310", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_77"}, "inbound_nodes": [[["conv1d_116", 0, 0, {}]]], "name": "time_distributed_77"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_311", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_78"}, "inbound_nodes": [[["conv1d_115", 0, 0, {}]]], "name": "time_distributed_78"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_305", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_191", 0, 0, {}]]], "name": "dense_305"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_306", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_192", 0, 0, {}]]], "name": "dense_306"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_307", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_193", 0, 0, {}]]], "name": "dense_307"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_311"}, "inbound_nodes": [[["time_distributed_77", 0, 0, {}]]], "name": "flatten_311"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_312"}, "inbound_nodes": [[["time_distributed_78", 0, 0, {}]]], "name": "flatten_312"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_194", "axis": -1}, "inbound_nodes": [[["dense_305", 0, 0, {}], ["dense_306", 0, 0, {}], ["dense_307", 0, 0, {}]]], "name": "concatenate_194"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_77"}, "inbound_nodes": [[["conv1d_116", 0, 0, {}]]], "name": "permute_77"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_77"}, "inbound_nodes": [[["flatten_311", 0, 0, {}]]], "name": "activation_77"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_78"}, "inbound_nodes": [[["conv1d_115", 0, 0, {}]]], "name": "permute_78"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_78"}, "inbound_nodes": [[["flatten_312", 0, 0, {}]]], "name": "activation_78"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_308", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_194", 0, 0, {}]]], "name": "dense_308"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_77"}, "inbound_nodes": [[["permute_77", 0, 0, {}], ["activation_77", 0, 0, {}]]], "name": "dot_77"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_78"}, "inbound_nodes": [[["permute_78", 0, 0, {}], ["activation_78", 0, 0, {}]]], "name": "dot_78"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_309", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_308", 0, 0, {}]]], "name": "dense_309"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_195", "axis": -1}, "inbound_nodes": [[["dot_77", 0, 0, {}], ["dot_78", 0, 0, {}], ["dense_309", 0, 0, {}]]], "name": "concatenate_195"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_312", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_195", 0, 0, {}]]], "name": "dense_312"}], "input_layers": [["input_77", 0, 0], ["input_78", 0, 0]], "output_layers": [["dense_312", 0, 0]], "name": "model_39"}, "backend": "tensorflow"}