{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_36", "sparse": false}, "inbound_nodes": [], "name": "input_36"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_53", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_36", 0, 0, {}]]], "name": "conv1d_53"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_53", "pool_size": [2]}, "inbound_nodes": [[["conv1d_53", 0, 0, {}]]], "name": "max_pooling1d_53"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_35", "sparse": false}, "inbound_nodes": [], "name": "input_35"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_54", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_53", 0, 0, {}]]], "name": "conv1d_54"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_52", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_35", 0, 0, {}]]], "name": "conv1d_52"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_54", "pool_size": [2]}, "inbound_nodes": [[["conv1d_54", 0, 0, {}]]], "name": "max_pooling1d_54"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_137"}, "inbound_nodes": [[["conv1d_52", 0, 0, {}]]], "name": "flatten_137"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_140"}, "inbound_nodes": [[["input_36", 0, 0, {}]]], "name": "flatten_140"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_138"}, "inbound_nodes": [[["conv1d_52", 0, 0, {}]]], "name": "flatten_138"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_141"}, "inbound_nodes": [[["max_pooling1d_53", 0, 0, {}]]], "name": "flatten_141"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_139"}, "inbound_nodes": [[["conv1d_52", 0, 0, {}]]], "name": "flatten_139"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_142"}, "inbound_nodes": [[["max_pooling1d_54", 0, 0, {}]]], "name": "flatten_142"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_86", "axis": -1}, "inbound_nodes": [[["flatten_137", 0, 0, {}], ["flatten_140", 0, 0, {}]]], "name": "concatenate_86"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_87", "axis": -1}, "inbound_nodes": [[["flatten_138", 0, 0, {}], ["flatten_141", 0, 0, {}]]], "name": "concatenate_87"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_88", "axis": -1}, "inbound_nodes": [[["flatten_139", 0, 0, {}], ["flatten_142", 0, 0, {}]]], "name": "concatenate_88"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_142", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_35"}, "inbound_nodes": [[["conv1d_53", 0, 0, {}]]], "name": "time_distributed_35"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_143", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_36"}, "inbound_nodes": [[["conv1d_52", 0, 0, {}]]], "name": "time_distributed_36"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_137", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_86", 0, 0, {}]]], "name": "dense_137"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_138", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_87", 0, 0, {}]]], "name": "dense_138"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_139", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_88", 0, 0, {}]]], "name": "dense_139"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_143"}, "inbound_nodes": [[["time_distributed_35", 0, 0, {}]]], "name": "flatten_143"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_144"}, "inbound_nodes": [[["time_distributed_36", 0, 0, {}]]], "name": "flatten_144"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_89", "axis": -1}, "inbound_nodes": [[["dense_137", 0, 0, {}], ["dense_138", 0, 0, {}], ["dense_139", 0, 0, {}]]], "name": "concatenate_89"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_35"}, "inbound_nodes": [[["conv1d_53", 0, 0, {}]]], "name": "permute_35"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_35"}, "inbound_nodes": [[["flatten_143", 0, 0, {}]]], "name": "activation_35"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_36"}, "inbound_nodes": [[["conv1d_52", 0, 0, {}]]], "name": "permute_36"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_36"}, "inbound_nodes": [[["flatten_144", 0, 0, {}]]], "name": "activation_36"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_140", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_89", 0, 0, {}]]], "name": "dense_140"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_35"}, "inbound_nodes": [[["permute_35", 0, 0, {}], ["activation_35", 0, 0, {}]]], "name": "dot_35"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_36"}, "inbound_nodes": [[["permute_36", 0, 0, {}], ["activation_36", 0, 0, {}]]], "name": "dot_36"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_141", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_140", 0, 0, {}]]], "name": "dense_141"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_90", "axis": -1}, "inbound_nodes": [[["dot_35", 0, 0, {}], ["dot_36", 0, 0, {}], ["dense_141", 0, 0, {}]]], "name": "concatenate_90"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_144", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_90", 0, 0, {}]]], "name": "dense_144"}], "input_layers": [["input_35", 0, 0], ["input_36", 0, 0]], "output_layers": [["dense_144", 0, 0]], "name": "model_18"}, "backend": "tensorflow"}