{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_22", "sparse": false}, "inbound_nodes": [], "name": "input_22"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_32", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_22", 0, 0, {}]]], "name": "conv1d_32"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_32", "pool_size": [2]}, "inbound_nodes": [[["conv1d_32", 0, 0, {}]]], "name": "max_pooling1d_32"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_21", "sparse": false}, "inbound_nodes": [], "name": "input_21"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_33", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_32", 0, 0, {}]]], "name": "conv1d_33"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_31", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_21", 0, 0, {}]]], "name": "conv1d_31"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_33", "pool_size": [2]}, "inbound_nodes": [[["conv1d_33", 0, 0, {}]]], "name": "max_pooling1d_33"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_81"}, "inbound_nodes": [[["conv1d_31", 0, 0, {}]]], "name": "flatten_81"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_84"}, "inbound_nodes": [[["input_22", 0, 0, {}]]], "name": "flatten_84"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_82"}, "inbound_nodes": [[["conv1d_31", 0, 0, {}]]], "name": "flatten_82"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_85"}, "inbound_nodes": [[["max_pooling1d_32", 0, 0, {}]]], "name": "flatten_85"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_83"}, "inbound_nodes": [[["conv1d_31", 0, 0, {}]]], "name": "flatten_83"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_86"}, "inbound_nodes": [[["max_pooling1d_33", 0, 0, {}]]], "name": "flatten_86"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_51", "axis": -1}, "inbound_nodes": [[["flatten_81", 0, 0, {}], ["flatten_84", 0, 0, {}]]], "name": "concatenate_51"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_52", "axis": -1}, "inbound_nodes": [[["flatten_82", 0, 0, {}], ["flatten_85", 0, 0, {}]]], "name": "concatenate_52"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_53", "axis": -1}, "inbound_nodes": [[["flatten_83", 0, 0, {}], ["flatten_86", 0, 0, {}]]], "name": "concatenate_53"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_86", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_21"}, "inbound_nodes": [[["conv1d_32", 0, 0, {}]]], "name": "time_distributed_21"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_87", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_22"}, "inbound_nodes": [[["conv1d_31", 0, 0, {}]]], "name": "time_distributed_22"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_81", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_51", 0, 0, {}]]], "name": "dense_81"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_82", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_52", 0, 0, {}]]], "name": "dense_82"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_83", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_53", 0, 0, {}]]], "name": "dense_83"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_87"}, "inbound_nodes": [[["time_distributed_21", 0, 0, {}]]], "name": "flatten_87"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_88"}, "inbound_nodes": [[["time_distributed_22", 0, 0, {}]]], "name": "flatten_88"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_54", "axis": -1}, "inbound_nodes": [[["dense_81", 0, 0, {}], ["dense_82", 0, 0, {}], ["dense_83", 0, 0, {}]]], "name": "concatenate_54"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_21"}, "inbound_nodes": [[["conv1d_32", 0, 0, {}]]], "name": "permute_21"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_21"}, "inbound_nodes": [[["flatten_87", 0, 0, {}]]], "name": "activation_21"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_22"}, "inbound_nodes": [[["conv1d_31", 0, 0, {}]]], "name": "permute_22"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_22"}, "inbound_nodes": [[["flatten_88", 0, 0, {}]]], "name": "activation_22"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_84", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_54", 0, 0, {}]]], "name": "dense_84"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_21"}, "inbound_nodes": [[["permute_21", 0, 0, {}], ["activation_21", 0, 0, {}]]], "name": "dot_21"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_22"}, "inbound_nodes": [[["permute_22", 0, 0, {}], ["activation_22", 0, 0, {}]]], "name": "dot_22"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_85", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_84", 0, 0, {}]]], "name": "dense_85"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_55", "axis": -1}, "inbound_nodes": [[["dot_21", 0, 0, {}], ["dot_22", 0, 0, {}], ["dense_85", 0, 0, {}]]], "name": "concatenate_55"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_88", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_55", 0, 0, {}]]], "name": "dense_88"}], "input_layers": [["input_21", 0, 0], ["input_22", 0, 0]], "output_layers": [["dense_88", 0, 0]], "name": "model_11"}, "backend": "tensorflow"}