{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_64", "sparse": false}, "inbound_nodes": [], "name": "input_64"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_95", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_64", 0, 0, {}]]], "name": "conv1d_95"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_95", "pool_size": [2]}, "inbound_nodes": [[["conv1d_95", 0, 0, {}]]], "name": "max_pooling1d_95"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_63", "sparse": false}, "inbound_nodes": [], "name": "input_63"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_96", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_95", 0, 0, {}]]], "name": "conv1d_96"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_94", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_63", 0, 0, {}]]], "name": "conv1d_94"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_96", "pool_size": [2]}, "inbound_nodes": [[["conv1d_96", 0, 0, {}]]], "name": "max_pooling1d_96"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_249"}, "inbound_nodes": [[["conv1d_94", 0, 0, {}]]], "name": "flatten_249"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_252"}, "inbound_nodes": [[["input_64", 0, 0, {}]]], "name": "flatten_252"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_250"}, "inbound_nodes": [[["conv1d_94", 0, 0, {}]]], "name": "flatten_250"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_253"}, "inbound_nodes": [[["max_pooling1d_95", 0, 0, {}]]], "name": "flatten_253"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_251"}, "inbound_nodes": [[["conv1d_94", 0, 0, {}]]], "name": "flatten_251"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_254"}, "inbound_nodes": [[["max_pooling1d_96", 0, 0, {}]]], "name": "flatten_254"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_156", "axis": -1}, "inbound_nodes": [[["flatten_249", 0, 0, {}], ["flatten_252", 0, 0, {}]]], "name": "concatenate_156"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_157", "axis": -1}, "inbound_nodes": [[["flatten_250", 0, 0, {}], ["flatten_253", 0, 0, {}]]], "name": "concatenate_157"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_158", "axis": -1}, "inbound_nodes": [[["flatten_251", 0, 0, {}], ["flatten_254", 0, 0, {}]]], "name": "concatenate_158"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_254", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_63"}, "inbound_nodes": [[["conv1d_95", 0, 0, {}]]], "name": "time_distributed_63"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_255", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_64"}, "inbound_nodes": [[["conv1d_94", 0, 0, {}]]], "name": "time_distributed_64"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_249", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_156", 0, 0, {}]]], "name": "dense_249"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_250", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_157", 0, 0, {}]]], "name": "dense_250"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_251", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_158", 0, 0, {}]]], "name": "dense_251"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_255"}, "inbound_nodes": [[["time_distributed_63", 0, 0, {}]]], "name": "flatten_255"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_256"}, "inbound_nodes": [[["time_distributed_64", 0, 0, {}]]], "name": "flatten_256"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_159", "axis": -1}, "inbound_nodes": [[["dense_249", 0, 0, {}], ["dense_250", 0, 0, {}], ["dense_251", 0, 0, {}]]], "name": "concatenate_159"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_63"}, "inbound_nodes": [[["conv1d_95", 0, 0, {}]]], "name": "permute_63"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_63"}, "inbound_nodes": [[["flatten_255", 0, 0, {}]]], "name": "activation_63"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_64"}, "inbound_nodes": [[["conv1d_94", 0, 0, {}]]], "name": "permute_64"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_64"}, "inbound_nodes": [[["flatten_256", 0, 0, {}]]], "name": "activation_64"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_252", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_159", 0, 0, {}]]], "name": "dense_252"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_63"}, "inbound_nodes": [[["permute_63", 0, 0, {}], ["activation_63", 0, 0, {}]]], "name": "dot_63"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_64"}, "inbound_nodes": [[["permute_64", 0, 0, {}], ["activation_64", 0, 0, {}]]], "name": "dot_64"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_253", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_252", 0, 0, {}]]], "name": "dense_253"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_160", "axis": -1}, "inbound_nodes": [[["dot_63", 0, 0, {}], ["dot_64", 0, 0, {}], ["dense_253", 0, 0, {}]]], "name": "concatenate_160"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_256", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_160", 0, 0, {}]]], "name": "dense_256"}], "input_layers": [["input_63", 0, 0], ["input_64", 0, 0]], "output_layers": [["dense_256", 0, 0]], "name": "model_32"}, "backend": "tensorflow"}