{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_52", "sparse": false}, "inbound_nodes": [], "name": "input_52"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_77", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_52", 0, 0, {}]]], "name": "conv1d_77"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_77", "pool_size": [2]}, "inbound_nodes": [[["conv1d_77", 0, 0, {}]]], "name": "max_pooling1d_77"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_51", "sparse": false}, "inbound_nodes": [], "name": "input_51"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_78", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_77", 0, 0, {}]]], "name": "conv1d_78"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_76", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_51", 0, 0, {}]]], "name": "conv1d_76"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_78", "pool_size": [2]}, "inbound_nodes": [[["conv1d_78", 0, 0, {}]]], "name": "max_pooling1d_78"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_201"}, "inbound_nodes": [[["conv1d_76", 0, 0, {}]]], "name": "flatten_201"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_204"}, "inbound_nodes": [[["input_52", 0, 0, {}]]], "name": "flatten_204"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_202"}, "inbound_nodes": [[["conv1d_76", 0, 0, {}]]], "name": "flatten_202"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_205"}, "inbound_nodes": [[["max_pooling1d_77", 0, 0, {}]]], "name": "flatten_205"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_203"}, "inbound_nodes": [[["conv1d_76", 0, 0, {}]]], "name": "flatten_203"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_206"}, "inbound_nodes": [[["max_pooling1d_78", 0, 0, {}]]], "name": "flatten_206"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_126", "axis": -1}, "inbound_nodes": [[["flatten_201", 0, 0, {}], ["flatten_204", 0, 0, {}]]], "name": "concatenate_126"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_127", "axis": -1}, "inbound_nodes": [[["flatten_202", 0, 0, {}], ["flatten_205", 0, 0, {}]]], "name": "concatenate_127"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_128", "axis": -1}, "inbound_nodes": [[["flatten_203", 0, 0, {}], ["flatten_206", 0, 0, {}]]], "name": "concatenate_128"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_206", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_51"}, "inbound_nodes": [[["conv1d_77", 0, 0, {}]]], "name": "time_distributed_51"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_207", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_52"}, "inbound_nodes": [[["conv1d_76", 0, 0, {}]]], "name": "time_distributed_52"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_201", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_126", 0, 0, {}]]], "name": "dense_201"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_202", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_127", 0, 0, {}]]], "name": "dense_202"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_203", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_128", 0, 0, {}]]], "name": "dense_203"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_207"}, "inbound_nodes": [[["time_distributed_51", 0, 0, {}]]], "name": "flatten_207"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_208"}, "inbound_nodes": [[["time_distributed_52", 0, 0, {}]]], "name": "flatten_208"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_129", "axis": -1}, "inbound_nodes": [[["dense_201", 0, 0, {}], ["dense_202", 0, 0, {}], ["dense_203", 0, 0, {}]]], "name": "concatenate_129"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_51"}, "inbound_nodes": [[["conv1d_77", 0, 0, {}]]], "name": "permute_51"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_51"}, "inbound_nodes": [[["flatten_207", 0, 0, {}]]], "name": "activation_51"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_52"}, "inbound_nodes": [[["conv1d_76", 0, 0, {}]]], "name": "permute_52"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_52"}, "inbound_nodes": [[["flatten_208", 0, 0, {}]]], "name": "activation_52"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_204", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_129", 0, 0, {}]]], "name": "dense_204"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_51"}, "inbound_nodes": [[["permute_51", 0, 0, {}], ["activation_51", 0, 0, {}]]], "name": "dot_51"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_52"}, "inbound_nodes": [[["permute_52", 0, 0, {}], ["activation_52", 0, 0, {}]]], "name": "dot_52"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_205", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_204", 0, 0, {}]]], "name": "dense_205"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_130", "axis": -1}, "inbound_nodes": [[["dot_51", 0, 0, {}], ["dot_52", 0, 0, {}], ["dense_205", 0, 0, {}]]], "name": "concatenate_130"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_208", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_130", 0, 0, {}]]], "name": "dense_208"}], "input_layers": [["input_51", 0, 0], ["input_52", 0, 0]], "output_layers": [["dense_208", 0, 0]], "name": "model_26"}, "backend": "tensorflow"}