{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_6", "sparse": false}, "inbound_nodes": [], "name": "input_6"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_8", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_6", 0, 0, {}]]], "name": "conv1d_8"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_8", "pool_size": [2]}, "inbound_nodes": [[["conv1d_8", 0, 0, {}]]], "name": "max_pooling1d_8"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_5", "sparse": false}, "inbound_nodes": [], "name": "input_5"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_9", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_8", 0, 0, {}]]], "name": "conv1d_9"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_7", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_5", 0, 0, {}]]], "name": "conv1d_7"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_9", "pool_size": [2]}, "inbound_nodes": [[["conv1d_9", 0, 0, {}]]], "name": "max_pooling1d_9"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_17"}, "inbound_nodes": [[["conv1d_7", 0, 0, {}]]], "name": "flatten_17"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_20"}, "inbound_nodes": [[["input_6", 0, 0, {}]]], "name": "flatten_20"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_18"}, "inbound_nodes": [[["conv1d_7", 0, 0, {}]]], "name": "flatten_18"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_21"}, "inbound_nodes": [[["max_pooling1d_8", 0, 0, {}]]], "name": "flatten_21"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_19"}, "inbound_nodes": [[["conv1d_7", 0, 0, {}]]], "name": "flatten_19"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_22"}, "inbound_nodes": [[["max_pooling1d_9", 0, 0, {}]]], "name": "flatten_22"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_11", "axis": -1}, "inbound_nodes": [[["flatten_17", 0, 0, {}], ["flatten_20", 0, 0, {}]]], "name": "concatenate_11"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_12", "axis": -1}, "inbound_nodes": [[["flatten_18", 0, 0, {}], ["flatten_21", 0, 0, {}]]], "name": "concatenate_12"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_13", "axis": -1}, "inbound_nodes": [[["flatten_19", 0, 0, {}], ["flatten_22", 0, 0, {}]]], "name": "concatenate_13"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_22", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_5"}, "inbound_nodes": [[["conv1d_8", 0, 0, {}]]], "name": "time_distributed_5"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_23", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_6"}, "inbound_nodes": [[["conv1d_7", 0, 0, {}]]], "name": "time_distributed_6"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_17", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_11", 0, 0, {}]]], "name": "dense_17"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_18", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_12", 0, 0, {}]]], "name": "dense_18"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_19", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_13", 0, 0, {}]]], "name": "dense_19"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_23"}, "inbound_nodes": [[["time_distributed_5", 0, 0, {}]]], "name": "flatten_23"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_24"}, "inbound_nodes": [[["time_distributed_6", 0, 0, {}]]], "name": "flatten_24"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_14", "axis": -1}, "inbound_nodes": [[["dense_17", 0, 0, {}], ["dense_18", 0, 0, {}], ["dense_19", 0, 0, {}]]], "name": "concatenate_14"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_5"}, "inbound_nodes": [[["conv1d_8", 0, 0, {}]]], "name": "permute_5"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_5"}, "inbound_nodes": [[["flatten_23", 0, 0, {}]]], "name": "activation_5"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_6"}, "inbound_nodes": [[["conv1d_7", 0, 0, {}]]], "name": "permute_6"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_6"}, "inbound_nodes": [[["flatten_24", 0, 0, {}]]], "name": "activation_6"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_20", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_14", 0, 0, {}]]], "name": "dense_20"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_5"}, "inbound_nodes": [[["permute_5", 0, 0, {}], ["activation_5", 0, 0, {}]]], "name": "dot_5"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_6"}, "inbound_nodes": [[["permute_6", 0, 0, {}], ["activation_6", 0, 0, {}]]], "name": "dot_6"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_21", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_20", 0, 0, {}]]], "name": "dense_21"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_15", "axis": -1}, "inbound_nodes": [[["dot_5", 0, 0, {}], ["dot_6", 0, 0, {}], ["dense_21", 0, 0, {}]]], "name": "concatenate_15"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_24", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_15", 0, 0, {}]]], "name": "dense_24"}], "input_layers": [["input_5", 0, 0], ["input_6", 0, 0]], "output_layers": [["dense_24", 0, 0]], "name": "model_3"}, "backend": "tensorflow"}