{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_72", "sparse": false}, "inbound_nodes": [], "name": "input_72"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_107", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_72", 0, 0, {}]]], "name": "conv1d_107"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_107", "pool_size": [2]}, "inbound_nodes": [[["conv1d_107", 0, 0, {}]]], "name": "max_pooling1d_107"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_71", "sparse": false}, "inbound_nodes": [], "name": "input_71"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_108", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_107", 0, 0, {}]]], "name": "conv1d_108"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_106", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_71", 0, 0, {}]]], "name": "conv1d_106"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_108", "pool_size": [2]}, "inbound_nodes": [[["conv1d_108", 0, 0, {}]]], "name": "max_pooling1d_108"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_281"}, "inbound_nodes": [[["conv1d_106", 0, 0, {}]]], "name": "flatten_281"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_284"}, "inbound_nodes": [[["input_72", 0, 0, {}]]], "name": "flatten_284"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_282"}, "inbound_nodes": [[["conv1d_106", 0, 0, {}]]], "name": "flatten_282"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_285"}, "inbound_nodes": [[["max_pooling1d_107", 0, 0, {}]]], "name": "flatten_285"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_283"}, "inbound_nodes": [[["conv1d_106", 0, 0, {}]]], "name": "flatten_283"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_286"}, "inbound_nodes": [[["max_pooling1d_108", 0, 0, {}]]], "name": "flatten_286"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_176", "axis": -1}, "inbound_nodes": [[["flatten_281", 0, 0, {}], ["flatten_284", 0, 0, {}]]], "name": "concatenate_176"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_177", "axis": -1}, "inbound_nodes": [[["flatten_282", 0, 0, {}], ["flatten_285", 0, 0, {}]]], "name": "concatenate_177"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_178", "axis": -1}, "inbound_nodes": [[["flatten_283", 0, 0, {}], ["flatten_286", 0, 0, {}]]], "name": "concatenate_178"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_286", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_71"}, "inbound_nodes": [[["conv1d_107", 0, 0, {}]]], "name": "time_distributed_71"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_287", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_72"}, "inbound_nodes": [[["conv1d_106", 0, 0, {}]]], "name": "time_distributed_72"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_281", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_176", 0, 0, {}]]], "name": "dense_281"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_282", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_177", 0, 0, {}]]], "name": "dense_282"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_283", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_178", 0, 0, {}]]], "name": "dense_283"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_287"}, "inbound_nodes": [[["time_distributed_71", 0, 0, {}]]], "name": "flatten_287"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_288"}, "inbound_nodes": [[["time_distributed_72", 0, 0, {}]]], "name": "flatten_288"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_179", "axis": -1}, "inbound_nodes": [[["dense_281", 0, 0, {}], ["dense_282", 0, 0, {}], ["dense_283", 0, 0, {}]]], "name": "concatenate_179"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_71"}, "inbound_nodes": [[["conv1d_107", 0, 0, {}]]], "name": "permute_71"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_71"}, "inbound_nodes": [[["flatten_287", 0, 0, {}]]], "name": "activation_71"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_72"}, "inbound_nodes": [[["conv1d_106", 0, 0, {}]]], "name": "permute_72"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_72"}, "inbound_nodes": [[["flatten_288", 0, 0, {}]]], "name": "activation_72"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_284", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_179", 0, 0, {}]]], "name": "dense_284"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_71"}, "inbound_nodes": [[["permute_71", 0, 0, {}], ["activation_71", 0, 0, {}]]], "name": "dot_71"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_72"}, "inbound_nodes": [[["permute_72", 0, 0, {}], ["activation_72", 0, 0, {}]]], "name": "dot_72"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_285", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_284", 0, 0, {}]]], "name": "dense_285"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_180", "axis": -1}, "inbound_nodes": [[["dot_71", 0, 0, {}], ["dot_72", 0, 0, {}], ["dense_285", 0, 0, {}]]], "name": "concatenate_180"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_288", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_180", 0, 0, {}]]], "name": "dense_288"}], "input_layers": [["input_71", 0, 0], ["input_72", 0, 0]], "output_layers": [["dense_288", 0, 0]], "name": "model_36"}, "backend": "tensorflow"}