{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_84", "sparse": false}, "inbound_nodes": [], "name": "input_84"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_125", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_84", 0, 0, {}]]], "name": "conv1d_125"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_125", "pool_size": [2]}, "inbound_nodes": [[["conv1d_125", 0, 0, {}]]], "name": "max_pooling1d_125"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_83", "sparse": false}, "inbound_nodes": [], "name": "input_83"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_126", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_125", 0, 0, {}]]], "name": "conv1d_126"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_124", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_83", 0, 0, {}]]], "name": "conv1d_124"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_126", "pool_size": [2]}, "inbound_nodes": [[["conv1d_126", 0, 0, {}]]], "name": "max_pooling1d_126"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_329"}, "inbound_nodes": [[["conv1d_124", 0, 0, {}]]], "name": "flatten_329"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_332"}, "inbound_nodes": [[["input_84", 0, 0, {}]]], "name": "flatten_332"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_330"}, "inbound_nodes": [[["conv1d_124", 0, 0, {}]]], "name": "flatten_330"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_333"}, "inbound_nodes": [[["max_pooling1d_125", 0, 0, {}]]], "name": "flatten_333"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_331"}, "inbound_nodes": [[["conv1d_124", 0, 0, {}]]], "name": "flatten_331"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_334"}, "inbound_nodes": [[["max_pooling1d_126", 0, 0, {}]]], "name": "flatten_334"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_206", "axis": -1}, "inbound_nodes": [[["flatten_329", 0, 0, {}], ["flatten_332", 0, 0, {}]]], "name": "concatenate_206"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_207", "axis": -1}, "inbound_nodes": [[["flatten_330", 0, 0, {}], ["flatten_333", 0, 0, {}]]], "name": "concatenate_207"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_208", "axis": -1}, "inbound_nodes": [[["flatten_331", 0, 0, {}], ["flatten_334", 0, 0, {}]]], "name": "concatenate_208"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_334", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_83"}, "inbound_nodes": [[["conv1d_125", 0, 0, {}]]], "name": "time_distributed_83"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_335", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_84"}, "inbound_nodes": [[["conv1d_124", 0, 0, {}]]], "name": "time_distributed_84"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_329", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_206", 0, 0, {}]]], "name": "dense_329"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_330", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_207", 0, 0, {}]]], "name": "dense_330"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_331", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_208", 0, 0, {}]]], "name": "dense_331"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_335"}, "inbound_nodes": [[["time_distributed_83", 0, 0, {}]]], "name": "flatten_335"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_336"}, "inbound_nodes": [[["time_distributed_84", 0, 0, {}]]], "name": "flatten_336"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_209", "axis": -1}, "inbound_nodes": [[["dense_329", 0, 0, {}], ["dense_330", 0, 0, {}], ["dense_331", 0, 0, {}]]], "name": "concatenate_209"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_83"}, "inbound_nodes": [[["conv1d_125", 0, 0, {}]]], "name": "permute_83"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_83"}, "inbound_nodes": [[["flatten_335", 0, 0, {}]]], "name": "activation_83"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_84"}, "inbound_nodes": [[["conv1d_124", 0, 0, {}]]], "name": "permute_84"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_84"}, "inbound_nodes": [[["flatten_336", 0, 0, {}]]], "name": "activation_84"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_332", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_209", 0, 0, {}]]], "name": "dense_332"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_83"}, "inbound_nodes": [[["permute_83", 0, 0, {}], ["activation_83", 0, 0, {}]]], "name": "dot_83"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_84"}, "inbound_nodes": [[["permute_84", 0, 0, {}], ["activation_84", 0, 0, {}]]], "name": "dot_84"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_333", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_332", 0, 0, {}]]], "name": "dense_333"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_210", "axis": -1}, "inbound_nodes": [[["dot_83", 0, 0, {}], ["dot_84", 0, 0, {}], ["dense_333", 0, 0, {}]]], "name": "concatenate_210"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_336", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_210", 0, 0, {}]]], "name": "dense_336"}], "input_layers": [["input_83", 0, 0], ["input_84", 0, 0]], "output_layers": [["dense_336", 0, 0]], "name": "model_42"}, "backend": "tensorflow"}