{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_86", "sparse": false}, "inbound_nodes": [], "name": "input_86"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_128", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_86", 0, 0, {}]]], "name": "conv1d_128"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_128", "pool_size": [2]}, "inbound_nodes": [[["conv1d_128", 0, 0, {}]]], "name": "max_pooling1d_128"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_85", "sparse": false}, "inbound_nodes": [], "name": "input_85"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_129", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_128", 0, 0, {}]]], "name": "conv1d_129"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_127", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_85", 0, 0, {}]]], "name": "conv1d_127"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_129", "pool_size": [2]}, "inbound_nodes": [[["conv1d_129", 0, 0, {}]]], "name": "max_pooling1d_129"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_337"}, "inbound_nodes": [[["conv1d_127", 0, 0, {}]]], "name": "flatten_337"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_340"}, "inbound_nodes": [[["input_86", 0, 0, {}]]], "name": "flatten_340"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_338"}, "inbound_nodes": [[["conv1d_127", 0, 0, {}]]], "name": "flatten_338"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_341"}, "inbound_nodes": [[["max_pooling1d_128", 0, 0, {}]]], "name": "flatten_341"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_339"}, "inbound_nodes": [[["conv1d_127", 0, 0, {}]]], "name": "flatten_339"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_342"}, "inbound_nodes": [[["max_pooling1d_129", 0, 0, {}]]], "name": "flatten_342"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_211", "axis": -1}, "inbound_nodes": [[["flatten_337", 0, 0, {}], ["flatten_340", 0, 0, {}]]], "name": "concatenate_211"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_212", "axis": -1}, "inbound_nodes": [[["flatten_338", 0, 0, {}], ["flatten_341", 0, 0, {}]]], "name": "concatenate_212"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_213", "axis": -1}, "inbound_nodes": [[["flatten_339", 0, 0, {}], ["flatten_342", 0, 0, {}]]], "name": "concatenate_213"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_342", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_85"}, "inbound_nodes": [[["conv1d_128", 0, 0, {}]]], "name": "time_distributed_85"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_343", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_86"}, "inbound_nodes": [[["conv1d_127", 0, 0, {}]]], "name": "time_distributed_86"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_337", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_211", 0, 0, {}]]], "name": "dense_337"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_338", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_212", 0, 0, {}]]], "name": "dense_338"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_339", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_213", 0, 0, {}]]], "name": "dense_339"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_343"}, "inbound_nodes": [[["time_distributed_85", 0, 0, {}]]], "name": "flatten_343"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_344"}, "inbound_nodes": [[["time_distributed_86", 0, 0, {}]]], "name": "flatten_344"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_214", "axis": -1}, "inbound_nodes": [[["dense_337", 0, 0, {}], ["dense_338", 0, 0, {}], ["dense_339", 0, 0, {}]]], "name": "concatenate_214"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_85"}, "inbound_nodes": [[["conv1d_128", 0, 0, {}]]], "name": "permute_85"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_85"}, "inbound_nodes": [[["flatten_343", 0, 0, {}]]], "name": "activation_85"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_86"}, "inbound_nodes": [[["conv1d_127", 0, 0, {}]]], "name": "permute_86"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_86"}, "inbound_nodes": [[["flatten_344", 0, 0, {}]]], "name": "activation_86"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_340", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_214", 0, 0, {}]]], "name": "dense_340"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_85"}, "inbound_nodes": [[["permute_85", 0, 0, {}], ["activation_85", 0, 0, {}]]], "name": "dot_85"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_86"}, "inbound_nodes": [[["permute_86", 0, 0, {}], ["activation_86", 0, 0, {}]]], "name": "dot_86"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_341", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_340", 0, 0, {}]]], "name": "dense_341"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_215", "axis": -1}, "inbound_nodes": [[["dot_85", 0, 0, {}], ["dot_86", 0, 0, {}], ["dense_341", 0, 0, {}]]], "name": "concatenate_215"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_344", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_215", 0, 0, {}]]], "name": "dense_344"}], "input_layers": [["input_85", 0, 0], ["input_86", 0, 0]], "output_layers": [["dense_344", 0, 0]], "name": "model_43"}, "backend": "tensorflow"}