{"class_name": "Model", "keras_version": "2.1.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 34, 20], "name": "input_16", "sparse": false}, "inbound_nodes": [], "name": "input_16"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_23", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_16", 0, 0, {}]]], "name": "conv1d_23"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_23", "pool_size": [2]}, "inbound_nodes": [[["conv1d_23", 0, 0, {}]]], "name": "max_pooling1d_23"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 24, 20], "name": "input_15", "sparse": false}, "inbound_nodes": [], "name": "input_15"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_24", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["max_pooling1d_23", 0, 0, {}]]], "name": "conv1d_24"}, {"class_name": "Conv1D", "config": {"kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "conv1d_22", "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "padding": "same", "strides": [1], "dilation_rate": [1], "kernel_regularizer": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "activity_regularizer": null, "kernel_size": [3]}, "inbound_nodes": [[["input_15", 0, 0, {}]]], "name": "conv1d_22"}, {"class_name": "MaxPooling1D", "config": {"padding": "valid", "strides": [2], "trainable": true, "name": "max_pooling1d_24", "pool_size": [2]}, "inbound_nodes": [[["conv1d_24", 0, 0, {}]]], "name": "max_pooling1d_24"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_57"}, "inbound_nodes": [[["conv1d_22", 0, 0, {}]]], "name": "flatten_57"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_60"}, "inbound_nodes": [[["input_16", 0, 0, {}]]], "name": "flatten_60"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_58"}, "inbound_nodes": [[["conv1d_22", 0, 0, {}]]], "name": "flatten_58"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_61"}, "inbound_nodes": [[["max_pooling1d_23", 0, 0, {}]]], "name": "flatten_61"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_59"}, "inbound_nodes": [[["conv1d_22", 0, 0, {}]]], "name": "flatten_59"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_62"}, "inbound_nodes": [[["max_pooling1d_24", 0, 0, {}]]], "name": "flatten_62"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_36", "axis": -1}, "inbound_nodes": [[["flatten_57", 0, 0, {}], ["flatten_60", 0, 0, {}]]], "name": "concatenate_36"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_37", "axis": -1}, "inbound_nodes": [[["flatten_58", 0, 0, {}], ["flatten_61", 0, 0, {}]]], "name": "concatenate_37"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_38", "axis": -1}, "inbound_nodes": [[["flatten_59", 0, 0, {}], ["flatten_62", 0, 0, {}]]], "name": "concatenate_38"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_62", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_15"}, "inbound_nodes": [[["conv1d_23", 0, 0, {}]]], "name": "time_distributed_15"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_63", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}}, "trainable": true, "name": "time_distributed_16"}, "inbound_nodes": [[["conv1d_22", 0, 0, {}]]], "name": "time_distributed_16"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_57", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_36", 0, 0, {}]]], "name": "dense_57"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_58", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_37", 0, 0, {}]]], "name": "dense_58"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_59", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_38", 0, 0, {}]]], "name": "dense_59"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_63"}, "inbound_nodes": [[["time_distributed_15", 0, 0, {}]]], "name": "flatten_63"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_64"}, "inbound_nodes": [[["time_distributed_16", 0, 0, {}]]], "name": "flatten_64"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_39", "axis": -1}, "inbound_nodes": [[["dense_57", 0, 0, {}], ["dense_58", 0, 0, {}], ["dense_59", 0, 0, {}]]], "name": "concatenate_39"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_15"}, "inbound_nodes": [[["conv1d_23", 0, 0, {}]]], "name": "permute_15"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_15"}, "inbound_nodes": [[["flatten_63", 0, 0, {}]]], "name": "activation_15"}, {"class_name": "Permute", "config": {"dims": [2, 1], "trainable": true, "name": "permute_16"}, "inbound_nodes": [[["conv1d_22", 0, 0, {}]]], "name": "permute_16"}, {"class_name": "Activation", "config": {"activation": "softmax", "trainable": true, "name": "activation_16"}, "inbound_nodes": [[["flatten_64", 0, 0, {}]]], "name": "activation_16"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_60", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_39", 0, 0, {}]]], "name": "dense_60"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_15"}, "inbound_nodes": [[["permute_15", 0, 0, {}], ["activation_15", 0, 0, {}]]], "name": "dot_15"}, {"class_name": "Dot", "config": {"normalize": false, "trainable": true, "axes": -1, "name": "dot_16"}, "inbound_nodes": [[["permute_16", 0, 0, {}], ["activation_16", 0, 0, {}]]], "name": "dot_16"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_61", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 2, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["dense_60", 0, 0, {}]]], "name": "dense_61"}, {"class_name": "Concatenate", "config": {"trainable": true, "name": "concatenate_40", "axis": -1}, "inbound_nodes": [[["dot_15", 0, 0, {}], ["dot_16", 0, 0, {}], ["dense_61", 0, 0, {}]]], "name": "concatenate_40"}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_64", "kernel_constraint": null, "bias_regularizer": null, "bias_constraint": null, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1, "use_bias": true, "activity_regularizer": null}, "inbound_nodes": [[["concatenate_40", 0, 0, {}]]], "name": "dense_64"}], "input_layers": [["input_15", 0, 0], ["input_16", 0, 0]], "output_layers": [["dense_64", 0, 0]], "name": "model_8"}, "backend": "tensorflow"}